Revit 2016 API
UIView.ZoomSheetSize Method
Zoom to the sheet size.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public void ZoomSheetSize()
Visual Basic
Public Sub ZoomSheetSize
Visual C++
public:
void ZoomSheetSize()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | The view is not a graphical view.
See Also
UIView Class
Autodesk.Revit.UI Namespace